In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.091219  0.487019  1.589985  0.379680
2013-01-02 -0.671658  0.800972 -0.879278  1.361389
2013-01-03  1.328015  0.447049 -2.000132  1.672004
2013-01-04  0.685786  0.301636 -0.739234 -1.777107
2013-01-05 -0.859755  0.650850 -1.203459 -0.718854
2013-01-06 -0.984935 -1.531538 -0.451946  0.147167

In [11]:
df2 = pd.DataFrame(
   ...:     {
   ...:         "A": 1.0,
   ...:         "B": pd.Timestamp("20130102"),
   ...:         "C": pd.Series(1, index=list(range(4)), dtype="float32"),
   ...:         "D": np.array([3] * 4, dtype="int32"),
   ...:         "E": pd.Categorical(["test", "train", "test", "train"]),
   ...:         "F": "foo",
   ...:     }
   ...: )

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [17]:
df.to_numpy()

array([[-0.09121872,  0.48701919,  1.58998453,  0.37967961],
       [-0.67165782,  0.80097156, -0.87927787,  1.36138871],
       [ 1.32801525,  0.44704905, -2.00013186,  1.67200394],
       [ 0.6857862 ,  0.30163597, -0.73923393, -1.77710664],
       [-0.8597545 ,  0.6508499 , -1.20345915, -0.71885372],
       [-0.98493548, -1.53153785, -0.45194629,  0.14716677]])

In [18]:
df.sort_index(axis = 1,ascending = False)

                   D         C         B         A
2013-01-01  0.379680  1.589985  0.487019 -0.091219
2013-01-02  1.361389 -0.879278  0.800972 -0.671658
2013-01-03  1.672004 -2.000132  0.447049  1.328015
2013-01-04 -1.777107 -0.739234  0.301636  0.685786
2013-01-05 -0.718854 -1.203459  0.650850 -0.859755
2013-01-06  0.147167 -0.451946 -1.531538 -0.984935

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.984935 -1.531538 -0.451946  0.147167
2013-01-04  0.685786  0.301636 -0.739234 -1.777107
2013-01-03  1.328015  0.447049 -2.000132  1.672004
2013-01-01 -0.091219  0.487019  1.589985  0.379680
2013-01-05 -0.859755  0.650850 -1.203459 -0.718854
2013-01-02 -0.671658  0.800972 -0.879278  1.361389

### Selection by label

In [23]:
df.loc[dates[0]]

A   -0.091219
B    0.487019
C    1.589985
D    0.379680
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.091219  0.487019
2013-01-02 -0.671658  0.800972
2013-01-03  1.328015  0.447049
2013-01-04  0.685786  0.301636
2013-01-05 -0.859755  0.650850
2013-01-06 -0.984935 -1.531538

In [25]:
df.loc["20130102", ["A", "B"]]

A   -0.671658
B    0.800972
Name: 2013-01-02 00:00:00, dtype: float64

In [26]:
df.loc[dates[0], "A"]

-0.09121872406064545

In [27]:
df.at[dates[0], "A"]

-0.09121872406064545

### Selection by position

In [30]:
df

                   A         B         C         D
2013-01-01 -0.091219  0.487019  1.589985  0.379680
2013-01-02 -0.671658  0.800972 -0.879278  1.361389
2013-01-03  1.328015  0.447049 -2.000132  1.672004
2013-01-04  0.685786  0.301636 -0.739234 -1.777107
2013-01-05 -0.859755  0.650850 -1.203459 -0.718854
2013-01-06 -0.984935 -1.531538 -0.451946  0.147167

In [28]:
df.iloc[3]

A    0.685786
B    0.301636
C   -0.739234
D   -1.777107
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.685786  0.301636
2013-01-05 -0.859755  0.650850

In [31]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.671658 -0.879278
2013-01-03  1.328015 -2.000132
2013-01-05 -0.859755 -1.203459

In [32]:
#For slicing rows explicitly:

df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.671658  0.800972 -0.879278  1.361389
2013-01-03  1.328015  0.447049 -2.000132  1.672004

In [33]:
# For slicing columns explicitly:

df.iloc[:, 1:3]

                   B         C
2013-01-01  0.487019  1.589985
2013-01-02  0.800972 -0.879278
2013-01-03  0.447049 -2.000132
2013-01-04  0.301636 -0.739234
2013-01-05  0.650850 -1.203459
2013-01-06 -1.531538 -0.451946

In [34]:
# For getting a value explicitly:

df.iloc[1, 1]

0.8009715615126937